RIET/src/InformationRegisters/LocalDistributionSettingsForNonLawsonCompanies/LocalDistributionSettingsForNonLawsonCompanies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LocalDistributionSettingsForNonLawsonCompanies</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>DefaultLegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </resources>
  <resources>
    <name>DefaultCostCenter</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <resources>
    <name>SpecifySegment</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyCostCenter</name>
    <type>
      <types>EnumRef.TypesOfCostCenters</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyProductLine</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyAgreementForRecharge</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyAcquisitionCost</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManagementAccountantSubscription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>UseCostCenterFromLegalEntityForNON_PO</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/TypesOfCostCenters/TypesOfCostCenters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfCostCenters</name>
  <enumValues>
    <name>LawsonAU</name>
  </enumValues>
  <enumValues>
    <name>FromSegment</name>
  </enumValues>
  <enumValues>
    <name>DefaultCostCenter</name>
  </enumValues>
  <enumValues>
    <name>FromLegalEntity_ProductLine</name>
  </enumValues>
  <enumValues>
    <name>CompanyCostCenters</name>
  </enumValues>
  <enumValues>
    <name>FromLegalEntity</name>
  </enumValues>
</mdclass:Enum>

RIET/src/InformationRegisters/LocalDistributionSettingsForNonLawsonCompanies/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// { RGS AArsentev S-I-0001800 22.28.2016 10:22:52	
	Если НЕ ЗначениеЗаполнено(Запись.SpecifyCostCenter) Тогда
		 Отказ = Истина;
		 Сообщить("Не выбрано 'Specify cost center'");
	КонецЕсли;
	 
	Если Запись.SpecifyCostCenter = Перечисления.TypesOfCostCenters.FromSegment и НЕ Запись.SpecifySegment Тогда
		Отказ = Истина;
		Сообщить("Не установлено свойство 'Specify Segment'");
	КонецЕсли;
	
	Если Запись.SpecifyCostCenter = Перечисления.TypesOfCostCenters.FromLegalEntity_ProductLine и НЕ Запись.SpecifyProductLine Тогда
		Отказ = Истина;
		Сообщить("Не установлено свойство 'Specify Product Line'");
	КонецЕсли; 
	
	Если Запись.SpecifyCostCenter = Перечисления.TypesOfCostCenters.DefaultCostCenter и НЕ ЗначениеЗаполнено(Запись.DefaultCostCenter) Тогда
		Отказ = Истина;
		Сообщить("Не выбран 'Default cost center'");
	КонецЕсли;
	 
    // } RGS AArsentev S-I-0001800 22.28.2016 10:22:52	
	РГСофт.ЗаполнитьModification(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура SpecifyCostCenterПриИзменении(Элемент)
	
	Если Запись.SpecifyCostCenter = ПредопределенноеЗначение("Перечисление.TypesOfCostCenters.DefaultCostCenter") Тогда 
		Элементы.DefaultCostCenter.Видимость = Истина;
	Иначе
		Элементы.DefaultCostCenter.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Запись.SpecifyCostCenter = ПредопределенноеЗначение("Перечисление.TypesOfCostCenters.DefaultCostCenter") Тогда 
		Элементы.DefaultCostCenter.Видимость = Истина;
	Иначе
		Элементы.DefaultCostCenter.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры
